
# ให้เขียนโปรแกรมเพื่อหาลำดับของรหัสนักศึกษาที่กำหนด เมื่อเรียงลำดับตามคะแนน (ลำดับที่ 1 คือมีคะแนนมากที่สุด)

# โดยรับข้อมูล รหัสนักศึกษา และ คะแนนเป็นเลขทศนิยม ที่ละบรรทัด

# และจบด้วย รหัสนักศึกษา ที่ต้องการหาลำดับ

# ในการคำนวณลำดับหากมีนักศึกษาที่ได้คะแนนเท่ากันให้เรียนลำดับตามรหัสนักศึกษา (เรียงแบบจำนวนเต็ม)

# และให้แสดงผลดังตัวอย่าง

#  *** Rank score ***
# Enter ID and Score end with ID : 121 87.25 221 77.00 321 82.50 421 69.75 521 66.00 421
# ['121', '87.25', '221', '77.00', '321', '82.50', '421', '69.75', '521', '66.00']
# 421
# {'121': 87.25, '221': 77.0, '321': 82.5, '421': 69.75, '521': 66.0}
# 4

print(" *** Rank score ***")
value = input("Enter ID and Score end with ID : ").split()
id = value[-1]
score = {}
for i in range(0,len(value)-1,2):
    score[value[i]] = float(value[i+1])
value.pop()
print(value)
print(id)
print(score)
print(sorted(score.values(),reverse=True).index(score[id])+1)